In [1]:
import pandas as pd

In [2]:
import numpy as np

In [14]:
people = {
    'first': ['Om', 'Avi', 'Sid', 'Sakshi', np.nan, None, 'NA'],
    'last': ['Galande', 'Waikar', 'Todkar', 'Fule', np.nan, np.nan, 'Missing'],
    'email': ['galandeonkar@001@gmail.com', 'aviwaikar@gmail.com', 'sid@gmail.com', 'sakshi@gmail.com', np.nan, np.nan, 'NA'],
    'age': ['22', '22', '22', '22' , None, None, 'Missing']
}

In [22]:
df = pd.DataFrame(people)
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [24]:
df

    first     last                       email   age
0      Om  Galande  galandeonkar@001@gmail.com    22
1     Avi   Waikar         aviwaikar@gmail.com    22
2     Sid   Todkar               sid@gmail.com    22
3  Sakshi     Fule            sakshi@gmail.com    22
4     NaN      NaN                         NaN  None
5    None      NaN                         NaN  None
6     NaN      NaN                         NaN   NaN

In [25]:
df.dropna()

    first     last                       email age
0      Om  Galande  galandeonkar@001@gmail.com  22
1     Avi   Waikar         aviwaikar@gmail.com  22
2     Sid   Todkar               sid@gmail.com  22
3  Sakshi     Fule            sakshi@gmail.com  22

In [26]:
df.dropna(axis='index', how='any')      #any value of rows missing

    first     last                       email age
0      Om  Galande  galandeonkar@001@gmail.com  22
1     Avi   Waikar         aviwaikar@gmail.com  22
2     Sid   Todkar               sid@gmail.com  22
3  Sakshi     Fule            sakshi@gmail.com  22

In [27]:
df.dropna(axis='index', how='all')     #all values of rows are missing

    first     last                       email age
0      Om  Galande  galandeonkar@001@gmail.com  22
1     Avi   Waikar         aviwaikar@gmail.com  22
2     Sid   Todkar               sid@gmail.com  22
3  Sakshi     Fule            sakshi@gmail.com  22

In [29]:
df.dropna(axis='columns', how='all')     #all values of columns are missing

    first     last                       email   age
0      Om  Galande  galandeonkar@001@gmail.com    22
1     Avi   Waikar         aviwaikar@gmail.com    22
2     Sid   Todkar               sid@gmail.com    22
3  Sakshi     Fule            sakshi@gmail.com    22
4     NaN      NaN                         NaN  None
5    None      NaN                         NaN  None
6     NaN      NaN                         NaN   NaN

In [30]:
df.dropna(axis='columns', how='any')      #any value of columns missing

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [31]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4   True   True   True   True
5   True   True   True   True
6   True   True   True   True

In [35]:
df.fillna('0', inplace=True)

In [36]:
df

    first     last                       email age
0      Om  Galande  galandeonkar@001@gmail.com  22
1     Avi   Waikar         aviwaikar@gmail.com  22
2     Sid   Todkar               sid@gmail.com  22
3  Sakshi     Fule            sakshi@gmail.com  22
4       0        0                           0   0
5       0        0                           0   0
6       0        0                           0   0

In [37]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [38]:
df['age'] = df['age'].astype(float)

In [39]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [40]:
df['age'].mean()

12.571428571428571